app/controllers/inventories_controller.rb

  def destroy
    @inventory.destroy
---
DELETE FROM "inventories" WHERE "inventories"."id" = $1  [["id", 1]]

    def set_inventory
      @inventory = Inventory.find(params[:id])
---
SELECT  "inventories".* FROM "inventories" WHERE "inventories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]