app/controllers/reports_controller.rb

SELECT  "survivors".* FROM "survivors" WHERE "survivors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "survivors" SET "is_infect" = $1, "updated_at" = $2 WHERE "survivors"."id" = $3  [["is_infect", true], ["updated_at", "2018-07-15 23:49:38.356577"], ["id", 1]]
INSERT INTO "reports" ("survivor_id", "survivor_id_report", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["survivor_id", 2], ["survivor_id_report", 3], ["created_at", "2018-07-16 20:01:49.726067"], ["updated_at", "2018-07-16 20:01:49.726067"]]
---
	def create
		@report = Report.new(report_params)
		@survivors = Survivor.find(@report.survivor_id_report)
		if @survivors.infected
			render json: {message: "infected survivor can't report"}, status: 400
		elsif @report.save

SELECT COUNT(*) FROM "survivors" WHERE "survivors"."infected" = $1  [["infected", false]]
---
	def infected
		survivor = Survivor.where(infected: true).count

SELECT COUNT(*) FROM "survivors" WHERE "survivors"."infected" = $1  [["infected", false]]
---
	def no_infected
		survivor = Survivor.where(infected: false).count

SELECT COUNT(*) FROM "survivors"
---
	def all_survivors
		survivors = Survivor.count.to_f

SELECT  "survivors".* FROM "survivors" WHERE "survivors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "reports" WHERE "reports"."survivor_id" = $1  [["survivor_id", 1]]
UPDATE "survivors" SET "is_infect" = $1, "updated_at" = $2 WHERE "survivors"."id" = $3  [["is_infect", true], ["updated_at", "2018-07-16 03:57:09.026598"], ["id", 1]]
---
	def infection_report
		survivor = Survivor.find(@report.survivor_id)
		total_reports = Report.where(survivor_id: @report.survivor_id).count
		survivor.update(infected: total_reports >= 3)