app/controllers/reports_controller.rb

SELECT COUNT(*) FROM "reports" WHERE "reports"."survivor_id" = $1  [["survivor_id", 2]]
---
	def infection_report
		survivor = Survivor.find(@report.survivor_id)
		total_reports = Report.where(survivor_id: @report.survivor_id).count