app/controllers/survivors_controller.rb

SELECT "survivors".* FROM "survivors"
---
  def index
    @survivors = Survivor.all

INSERT INTO "survivors" ("name", "age", "gender", "latitude", "longitude", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @survivor = Survivor.new(survivor_params)

    if @survivor.save

DELETE FROM "survivors" WHERE "survivors"."id" = $1  [["id", 1]]
---
  def destroy
    @survivor.destroy

SELECT  "survivors".* FROM "survivors" WHERE "survivors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_survivor
      @survivor = Survivor.find(params[:id])